99cats/ninetyninecats/app/controllers/cats_controller.rb

  def update
    @cat = Cat.find(params[:id])

    if @cat.update(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "cats" SET "name" = $1, "color" = $2, "sex" = $3, "updated_at" = $4 WHERE "cats"."id" = $5  [["name", "Snowflake"], ["color", "white"], ["sex", "F"], ["updated_at", "2020-11-02 03:31:27.942716"], ["id", 1]]